---
kind: other
id: Properties.T:Autodesk.Revit.DB.Visual.AssetProperties
source: html/a70c74d3-660f-2467-d4f8-23178aba091b.htm
---
# AssetProperties Properties

Identifies if the object is read-only or modifiable.
 If true, the object may not be modified. If false, the object's contents may be modified.